title: Encoded Powershell Script
description: Detects an encoded powershell script launched from an office document. 
status: stable
references:
    - https://community.sophos.com/sophos-labs/b/blog/posts/decoding-malicious-powershell
author: Harrison Crossley
date: 08/10/2021
tags:
- attack.Defense-Evasion
- attack.t1140
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|matches_regex: 
    - '(\s+-((?i)encod?e?d?c?o?m?m?a?n?d?|e|en|enc|ec)\s).*([A-Za-z0-9+/]{50,}[=]{0,2})'
    Parent_Process|contains|all:
    - 'winword.exe'
    - 'excel.exe'
    - 'powerpnt.exe'
    - 'outlook.exe'
  condition: selection
fields:
    - CommandLine
    - Parent_Process
falsepositives:
    - Unknown
level: High